Ran Plan for 11 projects:

1. project: `marketplace-ecr-prod` dir: `terraform/environments/prod/ecr` workspace: `default`
1. project: `marketplace-ecs-web-api-prod` dir: `terraform/environments/prod/ecs-web-api` workspace: `default`
1. project: `marketplace-ecs-scheduler-prod` dir: `terraform/environments/prod/ecs-scheduler` workspace: `default`
1. project: `marketplace-ecs-worker-prod` dir: `terraform/environments/prod/ecs-worker` workspace: `default`
1. project: `marketplace-ecs-legacy-api-prod` dir: `terraform/environments/prod/ecs-legacy-api` workspace: `default`
1. project: `marketplace-ecr-stage` dir: `terraform/environments/stage/ecr` workspace: `default`
1. project: `marketplace-ecs-web-api-stage` dir: `terraform/environments/stage/ecs-web-api` workspace: `default`
1. project: `marketplace-ecs-scheduler-stage` dir: `terraform/environments/stage/ecs-scheduler` workspace: `default`
1. project: `marketplace-sqs-stage` dir: `terraform/environments/stage/sqs` workspace: `default`
1. project: `marketplace-ecs-worker-stage` dir: `terraform/environments/stage/ecs-worker` workspace: `default`
1. project: `marketplace-ecs-legacy-api-stage` dir: `terraform/environments/stage/ecs-legacy-api` workspace: `default`
---

### 1. project: `marketplace-ecr-prod` dir: `terraform/environments/prod/ecr` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 init -input=false" in "/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/48/default/terraform/environments/prod/ecr": exit status 1

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecr_legacy_api...
- ecr_legacy_api in .terraform/modules/ecr_legacy_api/terraform/modules/ecr
- ecr_legacy_api.tags in .terraform/modules/ecr_legacy_api/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecr_scheduler...
- ecr_scheduler in .terraform/modules/ecr_scheduler/terraform/modules/ecr
- ecr_scheduler.tags in .terraform/modules/ecr_scheduler/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecr_web_api...
- ecr_web_api in .terraform/modules/ecr_web_api/terraform/modules/ecr
- ecr_web_api.tags in .terraform/modules/ecr_web_api/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecr_worker...
- ecr_worker in .terraform/modules/ecr_worker/terraform/modules/ecr
- ecr_worker.tags in .terraform/modules/ecr_worker/terraform/modules/common-tags

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v5.100.0...
╷
│ Error: Failed to install provider
│ 
│ Error while installing hashicorp/aws v5.100.0: open
│ /home/atlantis/.atlantis/plugin-cache/registry.terraform.io/hashicorp/aws/5.100.0/linux_amd64/terraform-provider-aws_v5.100.0_x5:
│ text file busy
╵


```
</details>

---
### 2. project: `marketplace-ecs-web-api-prod` dir: `terraform/environments/prod/ecs-web-api` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 init -input=false" in "/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/48/default/terraform/environments/prod/ecs-web-api": exit status 1

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for adot_sidecar...
- adot_sidecar in .terraform/modules/adot_sidecar/terraform/modules/adot-sidecar
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecs_security_group...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecs_service...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for web_api_logs...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for web_api_task_execution_role...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for web_api_task_role...
╷
│ Error: Failed to download module
│ 
│   on main.tf line 141:
│  141: module "web_api_logs" {
│ 
│ Could not download module "web_api_logs" (main.tf:141) source code from
│ "git::https://github.com/ryu-qqq/Infrastructure.git?ref=main": failed to
│ copy from .terraform/modules/adot_sidecar to
│ .terraform/modules/web_api_logs: lstat
│ .terraform/modules/adot_sidecar/sample.json: no such file or directory
╵

╷
│ Error: Failed to download module
│ 
│   on main.tf line 163:
│  163: module "ecs_security_group" {
│ 
│ Could not download module "ecs_security_group" (main.tf:163) source code
│ from "git::https://github.com/ryu-qqq/Infrastructure.git?ref=main": failed
│ to copy from .terraform/modules/adot_sidecar to
│ .terraform/modules/ecs_security_group: lstat
│ .terraform/modules/adot_sidecar/terraform/environments/prod/service-discovery/outputs.tf:
│ no such file or directory
╵

╷
│ Error: Failed to download module
│ 
│   on main.tf line 205:
│  205: module "web_api_task_execution_role" {
│ 
│ Could not download module "web_api_task_execution_role" (main.tf:205)
│ source code from
│ "git::https://github.com/ryu-qqq/Infrastructure.git?ref=main": failed to
│ copy from .terraform/modules/adot_sidecar to
│ .terraform/modules/web_api_task_execution_role: lstat
│ .terraform/modules/adot_sidecar/README.md: no such file or directory
╵

╷
│ Error: Failed to download module
│ 
│   on main.tf line 273:
│  273: module "web_api_task_role" {
│ 
│ Could not download module "web_api_task_role" (main.tf:273) source code
│ from "git::https://github.com/ryu-qqq/Infrastructure.git?ref=main": failed
│ to copy from .terraform/modules/adot_sidecar to
│ .terraform/modules/web_api_task_role: lstat
│ .terraform/modules/adot_sidecar/claudedocs/policy-exceptions: no such file
│ or directory
╵

╷
│ Error: Failed to download module
│ 
│   on main.tf line 414:
│  414: module "ecs_service" {
│ 
│ Could not download module "ecs_service" (main.tf:414) source code from
│ "git::https://github.com/ryu-qqq/Infrastructure.git?ref=main": failed to
│ copy from .terraform/modules/adot_sidecar to
│ .terraform/modules/ecs_service: lstat
│ .terraform/modules/adot_sidecar/terraform/modules/dynamodb: no such file or
│ directory
╵


```
</details>

---
### 3. project: `marketplace-ecs-scheduler-prod` dir: `terraform/environments/prod/ecs-scheduler` workspace: `default`
**Plan Error**
```
dir "terraform/environments/prod/ecs-scheduler" does not exist
```

---
### 4. project: `marketplace-ecs-worker-prod` dir: `terraform/environments/prod/ecs-worker` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-prod/marketplace-worker-prod"
        name                               = "marketplace-worker-prod"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-worker-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-worker-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-worker"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-prod:65" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-prod:65" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "marketplace-worker-prod" -> (known after apply)
      ~ revision                 = 65 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for marketplace-worker-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-worker-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-worker"
        }
        # (12 unchanged attributes hidden)
    }

  # module.worker_task_execution_role.aws_iam_role_policy.custom["ssm-access"] will be updated in-place
~ resource "aws_iam_role_policy" "custom" {
        id          = "marketplace-worker-execution-role-prod:marketplace-worker-execution-role-prod-ssm-access"
        name        = "marketplace-worker-execution-role-prod-ssm-access"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (2 unchanged elements hidden)
                            "arn:aws:ssm:ap-northeast-2:*:parameter/authhub/*",
                          + "arn:aws:ssm:ap-northeast-2:*:parameter/naver-commerce/*",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "kms:Decrypt",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kms:ap-northeast-2:646886795421:key/1f0c0d10-1a78-47c8-82c6-436f6a28b901",
                            "arn:aws:kms:ap-northeast-2:646886795421:key/f3020de8-a983-4918-8223-6a0fbda5f4f6",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.worker_task_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::646886795421:policy/marketplace-sqs-access-prod"] will be destroyed
  # (because key ["arn:aws:iam::646886795421:policy/marketplace-sqs-access-prod"] is not in for_each map)
- resource "aws_iam_role_policy_attachment" "aws-managed" {
      - id         = "marketplace-worker-task-role-prod-20260326012528726900000001" -> null
      - policy_arn = "arn:aws:iam::646886795421:policy/marketplace-sqs-access-prod" -> null
      - role       = "marketplace-worker-task-role-prod" -> null
    }

  # module.worker_task_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::646886795421:policy/marketplace-sqs-access-stage"] will be created
+ resource "aws_iam_role_policy_attachment" "aws-managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::646886795421:policy/marketplace-sqs-access-stage"
      + role       = "marketplace-worker-task-role-prod"
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Changes to Outputs:
~ task_definition_arn = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-prod:65" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-worker-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fprod%252Fecs-worker%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-worker-prod
  ```
Plan: 2 to add, 2 to change, 2 to destroy.

---
### 5. project: `marketplace-ecs-legacy-api-prod` dir: `terraform/environments/prod/ecs-legacy-api` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 init -input=false -upgrade" in "/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/48/default/terraform/environments/prod/ecs-legacy-api": exit status 1

Initializing the backend...
Upgrading modules...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for adot_sidecar...
- adot_sidecar in .terraform/modules/adot_sidecar/terraform/modules/adot-sidecar
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecs_security_group...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecs_service...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for legacy_api_logs...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for legacy_api_task_execution_role...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for legacy_api_task_role...
╷
│ Error: Failed to download module
│ 
│   on main.tf line 123:
│  123: module "legacy_api_logs" {
│ 
│ Could not download module "legacy_api_logs" (main.tf:123) source code from
│ "git::https://github.com/ryu-qqq/Infrastructure.git?ref=main": failed to
│ copy from .terraform/modules/adot_sidecar to
│ .terraform/modules/legacy_api_logs: lstat .terraform/modules/adot_sidecar:
│ no such file or directory
╵

╷
│ Error: Failed to download module
│ 
│   on main.tf line 142:
│  142: module "ecs_security_group" {
│ 
│ Could not download module "ecs_security_group" (main.tf:142) source code
│ from "git::https://github.com/ryu-qqq/Infrastructure.git?ref=main": failed
│ to copy from .terraform/modules/adot_sidecar to
│ .terraform/modules/ecs_security_group: lstat
│ .terraform/modules/adot_sidecar/terraform/modules/log-subscription-filter-v2:
│ no such file or directory
╵

╷
│ Error: Failed to download module
│ 
│   on main.tf line 192:
│  192: module "legacy_api_task_execution_role" {
│ 
│ Could not download module "legacy_api_task_execution_role" (main.tf:192)
│ source code from
│ "git::https://github.com/ryu-qqq/Infrastructure.git?ref=main": failed to
│ copy from .terraform/modules/adot_sidecar to
│ .terraform/modules/legacy_api_task_execution_role: lstat
│ .terraform/modules/adot_sidecar: no such file or directory
╵

╷
│ Error: Failed to download module
│ 
│   on main.tf line 258:
│  258: module "legacy_api_task_role" {
│ 
│ Could not download module "legacy_api_task_role" (main.tf:258) source code
│ from "git::https://github.com/ryu-qqq/Infrastructure.git?ref=main": failed
│ to copy from .terraform/modules/adot_sidecar to
│ .terraform/modules/legacy_api_task_role: lstat
│ .terraform/modules/adot_sidecar: no such file or directory
╵

╷
│ Error: Failed to download module
│ 
│   on main.tf line 371:
│  371: module "ecs_service" {
│ 
│ Could not download module "ecs_service" (main.tf:371) source code from
│ "git::https://github.com/ryu-qqq/Infrastructure.git?ref=main": failed to
│ copy from .terraform/modules/adot_sidecar to
│ .terraform/modules/ecs_service: lstat .terraform/modules/adot_sidecar: no
│ such file or directory
╵


```
</details>

---
### 6. project: `marketplace-ecr-stage` dir: `terraform/environments/stage/ecr` workspace: `default`
**Plan Error**
```
the default workspace at path terraform/environments/stage/ecr is currently locked by another command that is running for this pull request.
Wait until the previous command is complete and try again
```

---
### 7. project: `marketplace-ecs-web-api-stage` dir: `terraform/environments/stage/ecs-web-api` workspace: `default`
**Plan Error**
```
dir "terraform/environments/stage/ecs-web-api" does not exist
```

---
### 8. project: `marketplace-ecs-scheduler-stage` dir: `terraform/environments/stage/ecs-scheduler` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-stage/marketplace-scheduler-stage"
        name                               = "marketplace-scheduler-stage"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-scheduler-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-scheduler-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-scheduler"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-stage:474" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-stage:474" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-stage" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "marketplace-scheduler-stage" -> (known after apply)
      ~ revision                 = 474 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for marketplace-scheduler-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-scheduler-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-scheduler"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn   = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-stage:474" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-scheduler-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fecs-scheduler%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-scheduler-stage
  ```
Plan: 1 to add, 1 to change, 1 to destroy.

---
### 9. project: `marketplace-sqs-stage` dir: `terraform/environments/stage/sqs` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-sqs-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fsqs%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-sqs-stage
  ```

---
### 10. project: `marketplace-ecs-worker-stage` dir: `terraform/environments/stage/ecs-worker` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-stage/marketplace-worker-stage"
        name                               = "marketplace-worker-stage"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-worker-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-worker-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-worker"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-stage:416" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-stage:416" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-stage" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "marketplace-worker-stage" -> (known after apply)
      ~ revision                 = 416 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for marketplace-worker-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-worker-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-worker"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-stage:416" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-worker-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fecs-worker%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-worker-stage
  ```
Plan: 1 to add, 1 to change, 1 to destroy.

---
### 11. project: `marketplace-ecs-legacy-api-stage` dir: `terraform/environments/stage/ecs-legacy-api` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 init -input=false" in "/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/48/default/terraform/environments/stage/ecs-legacy-api": exit status 1

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for adot_sidecar...
- adot_sidecar in .terraform/modules/adot_sidecar/terraform/modules/adot-sidecar
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecs_security_group...
- ecs_security_group in .terraform/modules/ecs_security_group/terraform/modules/security-group
- ecs_security_group.tags in .terraform/modules/ecs_security_group/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecs_service...
- ecs_service in .terraform/modules/ecs_service/terraform/modules/ecs-service
- ecs_service.tags in .terraform/modules/ecs_service/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for legacy_api_logs...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for legacy_api_task_execution_role...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for legacy_api_task_role...
╷
│ Error: Failed to expand subdir globs
│ 
│ subdir "terraform/modules/cloudwatch-log-group" not found
╵

╷
│ Error: Failed to download module
│ 
│   on main.tf line 199:
│  199: module "legacy_api_task_execution_role" {
│ 
│ Could not download module "legacy_api_task_execution_role" (main.tf:199)
│ source code from
│ "git::https://github.com/ryu-qqq/Infrastructure.git?ref=main": failed to
│ copy from .terraform/modules/adot_sidecar to
│ .terraform/modules/legacy_api_task_execution_role: readdirent
│ .terraform/modules/adot_sidecar/terraform/environments/prod/cloudfront-redirect/scripts:
│ no such file or directory
╵

╷
│ Error: Failed to download module
│ 
│   on main.tf line 265:
│  265: module "legacy_api_task_role" {
│ 
│ Could not download module "legacy_api_task_role" (main.tf:265) source code
│ from "git::https://github.com/ryu-qqq/Infrastructure.git?ref=main": failed
│ to copy from .terraform/modules/adot_sidecar to
│ .terraform/modules/legacy_api_task_role: lstat
│ .terraform/modules/adot_sidecar/terraform/shared/rds/db_instance.tf: no
│ such file or directory
╵


```
</details>

---
### Plan Summary

11 projects, 3 with changes, 1 with no changes, 7 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```